// набор круд операций.
// инфраструктура, остов продуктов
// бд хардкор код, сигнлтон in memory который содержит объекты с которыми работаем,
// интерфейс который в него стучится
// компоненты, фабрики компонентов в интерфейсе
// dependency injection, свой движок
// поднять контекст, добавить туда синглтоны
// аннотации runtime, двухфазные конструкторы, proxy
// можно одну библиотеку - reflections - для сканирования пакетов,
// добавления в контекст классов, добавить аннот. прокси синглтон
// solid
// ui - консоль


// 2 атта
// добавить работу с базой данных
// драйвер для бд, лучше h2 бд.

// 3 атта
// ui, сервлет jsp, максимально простой интерфейс на localhost
// jar, jar, war (tomcat)
// библиотека только jstl
public class Main {
    public static void main(String[] args) {
        System.out.println("Hello world!");
    }
}